# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

password-not-set =
    .value = (танзим нашудааст)
failed-pp-change = Ниҳонвожаи асосӣ тағйир дода намешавад.
incorrect-pp = Шумо ниҳонвожаи асосии ҷориро нодуруст ворид кардед. Лутфан, аз нав кӯшиш кунед.
pp-change-ok = Ниҳонвожаи асосӣ бо муваффақият иваз карда шуд.
settings-pp-erased-ok = Шумо ниҳонвожаи асосии худро нест кардед. Ниҳонвожаҳои нигоҳдошташуда ва калидҳои хусусии гувоҳномаҳое, ки аз тарафи «{ -brand-short-name }» идора карда мешаванд, муҳофизат карда намешаванд.
settings-pp-not-wanted = Диққат! Шумо ба қарор омадед, ки ниҳонвожаи асосиро дигар истифода намебаред. Ниҳонвожаҳои нигоҳдошташуда ва калидҳои хусусии гувоҳномаҳое, ки аз тарафи «{ -brand-short-name }» идора карда мешаванд, муҳофизат карда намешаванд.
pp-change2empty-in-fips-mode = Айни ҳол шумо дар реҷаи «FIPS» қарор доред. Реҷаи «FIPS» талаб мекунад, ки ниҳонвожаи асосӣ танзим карда шавад.
pw-change-success-title = Ниҳонвожа бо муваффақият тағйир ёфт
pw-change-failed-title = Ниҳонвожа тағйир дода нашуд
pw-remove-button =
    .label = Тоза кардан
primary-password-dialog =
    .title = Ниҳонвожаи асосӣ
set-password-old-password = Ниҳонвожаи ҷорӣ:
set-password-new-password = Ниҳонвожаи наверо ворид намоед:
set-password-reenter-password = Ниҳонвожаро аз нав ворид намоед:
set-password-meter = Дараҷаи сифати ниҳонвожа
set-password-meter-loading = Бор шуда истодааст
primary-password-admin = Маъмури шумо талаб мекунад, ки шумо барои нигоҳ доштани воридшавиҳо ва ниҳонвожаҳо, як ниҳонвожаи асосиро танзим кунед.
primary-password-required-by-policy = Ташкилоти шумо талаб мекунад, ки шумо барои нигоҳ доштани воридшавиҳо ва ниҳонвожаҳо, як ниҳонвожаи асосиро танзим кунед.
primary-password-description = Ниҳонвожаи асосӣ барои ҳифз кардани баъзе маълумоти ҳассос монанди воридшавиҳо ва ниҳонвожаҳо дар ин дастгоҳ истифода мешавад. Агар шумо ниҳонвожаи асосиро эҷод кунед, аз шумо дархост карда мешавад, ки онро дар ҳар як ҷаласа як маротиба ворид намоед, вақте ки «{ -brand-short-name }» маълумоти ҳифзшудаеро, ки бо ниҳонвожа муҳофизат карда шудааст, дарёфт мекунад.
primary-password-warning = Лутфан, мутмаин шавед, ки ниҳонвожаи асосии танзимкардаи худро дар хотир доред. Агар шумо ниҳонвожаи асосии худро фаромӯш кунед, шумо ба ягон маълумоти ҳифзшуда ба воситаи ин ниҳонвожа дар дастгоҳӣ ҷорӣ дастрасӣ пайдо карда наметавонед.
remove-primary-password =
    .title = Тоза кардани ниҳонвожаи асосӣ
remove-info =
    .value = Барои идома додан, шумо бояд ниҳонвожаи ҷории худро ворид кунед:
remove-primary-password-warning1 = Ниҳонвожаи асосии шумо барои муҳофизат кардани маълумоти ҳассос монанди воридшавиҳо ва ниҳонвожаҳо истифода мешавад.
remove-primary-password-warning2 = Агар шумо ниҳонвожаи асосии худро тоза кунед, маълумоти шумо муҳофизат карда намешавад, агар шахсони бегона ба компютери шумо дастрасӣ пайдо кунанд.
remove-password-old-password =
    .value = Ниҳонвожаи ҷорӣ:
