# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

rights-title = Маълумот дар бораи ҳуқуқҳои шумо
rights-intro = { -brand-full-name } нармафзори ройгон ва дорои манбаи кушод мебошад, ки бо ҷамъияти ҳазорҳо барномасозон аз тамоми ҷаҳон сохта шудааст. Шумо бояд чизҳои зеринро донед:
rights-intro-point-1 =
    «{ -brand-short-name }» тибқи шартҳои <a data-l10n-name="mozilla-public-license-link">Иҷозатномаи ҷамъиятии «Mozilla»</a> ба шумо дастрас шудааст.
    Ин маънои онро дорад, ки шумо метавонед «{ -brand-short-name }»-ро истифода баред, нусха бардоред ва ба дигарон паҳн кунед. Шумо, инчунин, метавонед рамзи манбаи «{ -brand-short-name }»-ро ба таври дилхоҳ тағйир диҳед. Иҷозатномаи ҷамъиятии «Mozilla»,
    инчунин, ба шумо барои паҳн кардани версияҳои тағйирёфта ҳуқуқ медиҳад.
rights-intro-point-2 =
    Ба шумо нисбат ба тамғаҳои тиҷории «Mozilla Foundation» ё ягон тарафи дигар, аз он ҷумла,
    бе маҳдудият нисбат ба тамға ё номи «Firefox» ягон ҳуқуқи тамғаи тиҷорӣ ё иҷозатномавӣ таъмин нашудааст. Маълумоти иловагӣ нисбат ба тамғаҳои тиҷорӣ метавонад
    <a data-l10n-name="mozilla-trademarks-link">дар ин ҷо</a> пайдо карда шавад.
rights-intro-point-3 =
    Баъзе хусусиятҳо дар «{ -brand-short-name }», монанди «Гузоришдиҳанда дар бораи вайронӣ», ба шумо имкон медиҳанд, ки тавонед ба «{ -vendor-short-name }» изҳори назари худро пешниҳод намоед.
    Бо интихоби имкони пешниҳод кардани изҳори назар, шумо ба «{ -vendor-short-name }» барои
    истифодаи изҳори назар дар такмилдиҳии маҳсулоти худ, барои чоп кардани изҳори назар дар сомонаҳои худ ва паҳн кардани изҳори назар иҷозат медиҳед.
rights-intro-point-4 =
    Тарзи истифодаи маълумоти шахсии шумо ва изҳори назари пешниҳодшуда ба
    «{ -vendor-short-name }» ба воситаи «{ -brand-short-name }» дар санади
    <a data-l10n-name="mozilla-privacy-policy-link">Сиёсати махфияти «{ -brand-short-name }»</a> муайян карда шудааст.
rights-intro-point-4-unbranded = Ҳамаи сиёсатҳои махфияти татбиқшаванда барои ин маҳсул бояд дар ин рӯйхат нишон дода шаванд.
rights-intro-point-5 =
    Баъзе хусусияҳои «{ -brand-short-name }» хизматҳои иттилоотии интернетиро
    истифода мебаранд, аммо, мо кафолат дода наметавонем, ки онҳо 100% дуруст
    ва бехато кор мекунанд. Тафсилоти бештар, аз он ҷумла маълумот оид ба ғайрифаъол
    кардани хусусиятҳое, ки аз он хизматҳо истифода мебаранд, метавонед дар
    <a data-l10n-name="mozilla-service-terms-link">шартҳои хизматрасонӣ</a> пайдо кунед.
rights-intro-point-5-unbranded =
    Агар ин маҳсул хизматҳои интернетиро дар бар гирад, ҳамаи шартҳои татбиқшаванда
    барои истифодаи хизмат(ҳо) бояд ба қисмати
    <a data-l10n-name="mozilla-website-services-link">Хизматҳои интернетӣ</a> истинод карда шаванд.
rights-intro-point-6 =
    Барои пахш кардани баъзе намудҳои муҳтавои видеоӣ, «{ -brand-short-name }»
    баъзе модулҳои рамзкушоии муҳтаворо аз тарафҳои сеюм боргирӣ мекунад.
rights-webservices-header = Хидматҳои иттилоотии { -brand-full-name } дар асоси сомона
rights-webservices =
    «{ -brand-full-name }» аз хизматҳои иттилоотӣ дар асоси Интернет («Хизматҳо»)
    барои таъмин намудани баъзе хусусиятҳои таъминшуда барои истифодаи шумо
    дар ин версияи дуии «{ -brand-short-name }» мувофиқи шартҳои зерин истифода мебарад.
    Агар шумо нахоҳед, ки аз як ё якчанд Хизмат истифода баред ё шартҳои зеринро қабул кунед,
    шумо метавонед хусусият ё Хизмат(ҳо)ро ғайрифаъол кунед. Дастурҳо барои
    тарзи ғайрифаъолсозии хусусияти муайян ё Хизмат метавонад
    <a data-l10n-name="mozilla-disable-service-link">дар ин ҷо</a> пайдо карда шавад. Хусусиятҳои дигар
    ва Хизматҳо метавонанд дар хусусиятҳои барнома ғайрифаъол карда шаванд.
rights-safebrowsing =
    <strong>SafeBrowsing: </strong>Ғайрифаъолсозии хусусияти «Safe Browsing» тавсия дода намешавад,
    зеро ки ин амал метавонад натиҷаи равонакунии шумо ба сомонаҳои беэътимод гардад. Агар шумо хоҳед,
    ки ин хусусиятро комилан ғайрифаъол созед, қадамҳои зеринро иҷро намоед:
rights-safebrowsing-term-1 = Кушодани хусусиятҳои барнома
rights-safebrowsing-term-2 = Қисмати «Амният»-ро интихоб намоед
rights-safebrowsing-term-3 = Имкони «{ enableSafeBrowsing-label }»-ро бекор кунед
enableSafeBrowsing-label = Манъ кардани муҳтавои дурӯғӣ ва зараровар
rights-safebrowsing-term-4 = Акнун имкони «Тамошокунии бехатар» ғайрифаъол аст
rights-locationawarebrowsing = <strong>Тамошокунӣ дар асоси ҷойгиршавӣ: </strong>ҳамеша иҷозати шуморо дархост мекунад. Ягон маълумот дар бораи ҷойгиршавии шумо бе иҷозати шумо фиристода намешавад. Агар шумо хоҳед, ки ин хусусиятро комилан ғайрифаъол созед, қадамҳои зеринро иҷро намоед:
rights-locationawarebrowsing-term-1 = Дар навори нишонии URL, <code>about:config</code>-ро ворид кунед
rights-locationawarebrowsing-term-2 = geo.enabled-ро ворид кунед
rights-locationawarebrowsing-term-3 = Ба хусусияти geo.enabled ду бор зер кунед
rights-locationawarebrowsing-term-4 = Акнун имкони «Тамошокунӣ дар асоси ҷойгиршавӣ» ғайрифаъол аст
rights-webservices-unbranded =
    Маълумоти умумӣ оид ба хизматҳои сомонае, ки маҳсул дар бар мегирад, аз он ҷумла,
    дастурҳо барои ғайрифаъолсозии хизматҳо, агар лозим бошад, бояд дар ин ҷо
    оварда шавад.
rights-webservices-term-unbranded = Ҳамаи шартҳои хидматрасонии татбиқшаванда барои ин маҳсул бояд дар ин рӯйхат нишон дода шаванд.
rights-webservices-term-1 =
    { -vendor-short-name } ва саҳмгузорон, иҷозатномадорон ва шарикони он
    барои таъмин намудани Хизматҳои дақиқтарин ва навтарин фаъолият мекунанд.
    Аммо, мо кафолат дода наметавонем, ки ин маълумот пурмуҳтаво ва бехато аст.
    Барои мисол, хизмати «Safe Browsing» метавонад баъзе сомонаҳои хатарнокро
    муайян накунад, он, инчунин, метавонад баъзе сомонаҳои бехатарро ҳамчун сомонаҳои
    хатарнок ҳисоб кунад ва аз тарафи хизмати «Location Aware» ҳамаи ҷойгиршавиҳое, ки
    таъминкунандагони хизматҳои мо нишон медиҳанд, бо ҳисоби тахминӣ мебошанд, ва на
    мо ё таъминкунандагони хизматҳои мо барои дақиқии ҷойгиршавии таъминшуда кафолат
    намедиҳем.
rights-webservices-term-2 =
    { -vendor-short-name } метавонад кори «Хизматрасониҳоро» ба ихтиёри худ
    қатъ ё иваз кунад.
rights-webservices-term-3 =
    Шумо метавонед аз ин Хизматҳо бо версияи ҳамроҳии «{ -brand-short-name }»
    истифода баред, ва «{ -vendor-short-name }» ба шумо барои ин амал ҳуқуқ медиҳад.
    «{ -vendor-short-name }» ва иҷозатномадорони он дорои ҳамаи ҳуқуқҳои дигар нисбат
    ба Хизматҳо мебошанд. Шартҳои додашуда барои маҳдуд кардани ягон ҳуқуқе, ки
    мувофиқи иҷозатномаҳои манбаи кушод нисбат ба «{ -brand-short-name }» ва версияҳои
    манбаи кушоди нисбат ба «{ -brand-short-name }» дода шудааст, пешбинӣ карда нашудаанд.
rights-webservices-term-4 =
    <strong>Хизматҳо дар вазъияти «чӣ хеле ки бошанд» таъмин карда мешаванд.
    { -vendor-short-name }, саҳмгузорон, иҷозатномадорон ва паҳнкунандагони он
    нисбат ба ҳар гуна кафолате, ки ба таври мустақим ё ғайримустақим ифода мешавад,
    ҷавобгар намебошанд, аз он ҷумла бе ягон маҳдудият нисбат ба ҳар гуна кафолати он,
    ки Хизматҳо метавонанд барои тиҷорат истифода шаванд ва ба мақсадҳои муайяншудаи
    шумо мутобиқ бошанд, ҷавобгар намебошанд. Танҳо шумо дар интихоби Хизматҳо барои
    истифода дар мақсадҳои худ, аз он ҷумла, нисбат ба сифат ва самаранокии Хизматҳо
    ҷавобгар мебошед. Қонунгузории баъзеи кишварҳо барои татбиқи ягон истисно ё маҳдудият
    нисбат ба кафолатҳои ғайримустақим иҷозат намедиҳанд, ҳамин тавр раддияи ҷорӣ метавонад
    нисбат ба шумо татбиқ карда нашавад.</strong>
rights-webservices-term-5 =
    <strong>Ба истиснои ҳолатҳои дар қонунгузорӣ пешбинишуда, «{ -vendor-short-name }»,
    саҳмгузорон, иҷозатномадорон ва паҳнкунандагони он барои ягон вайроншавии
    ғайримустақим, маҳсус, ногаҳон, бевосита, ҷаримавӣ ё маъмулие, ки аз боиси барнома
    ё ба ягон сабаби дигари истифодаи «{ -brand-short-name }» ва Хизматҳо ба вуҷуд меояд,
    ҷавобгар намебошанд. Мувофиқи шартҳои мазкур, ҷавобгарии дастаҷамъӣ бояд аз
    $500 (панҷсад доллари ИМА) зиёд набошад. Қонунгузории баъзе кишварҳо барои вайроншавиҳои
    муайян ягон истисно ё маҳдудиятро иҷозат намедиҳанд, бинобар ин истисно ё маҳдудияти ҷорӣ
    метавонад нисбат ба шумо татбиқ карда нашавад.</strong>
rights-webservices-term-6 =
    { -vendor-short-name } метавонад баъзан ин шартҳоро ба таври зарурӣ
    таҷдид кунад. Ин шартҳо бе созишномаи хаттии { -vendor-short-name }
    тағйир дода ё бекор карда намешаванд.
rights-webservices-term-7 =
    Шартҳои мазкур мувофиқи қонунгузории Иёлоти Калифорния, ИМА,
    танзим карда мешаванд, ба истиснои муқаррароти зидди қонунгузории он.
    Агар ягон қисми шартҳои мазкур аз эътибор соқит дониста шавад, қисмҳои
    боқимонда дорои қувваи комил ва амалкунанда мебошанд. Дар сурати ба амал
    омадани ихтилоф байни версияи тарҷумашудаи шартҳои мазкур ва версияи
    аслии англисӣ, версияи англисӣ бояд афзал дониста шавад.
